In [1]:
# Dependencies
import requests


import pandas as pd
from pprint import pprint

from sqlalchemy import create_engine,inspect,extract
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session

from config import api_key,pwd

import psycopg2

In [2]:
url = f"https://min-api.cryptocompare.com/data/v2/histohour?fsym=BTC&tsym=USD&limit=2000&toTs=-1&api_key={api_key}"
r = requests.get(url)
data = r.json()

In [3]:
df = pd.DataFrame(data['Data']['Data'])
df.head()

,time,high,low,open,volumefrom,volumeto,close,conversionType,conversionSymbol
0,1636484400,66827.80,66359.20,66546.67,935.37,62250025.58,66825.48,direct,
1,1636488000,67360.62,66691.63,66825.48,969.37,65015022.13,67360.62,direct,
2,1636491600,67790.86,67278.33,67360.62,1368.25,92340110.81,67738.18,direct,
3,1636495200,67745.61,67013.24,67738.18,1012.69,68220159.64,67303.52,direct,
4,1636498800,67428.01,66769.96,67303.52,1067.80,71687916.27,66939.24,direct,

In [4]:
maxTs = df.iloc[0]['time']
limit = 2000
histo = 'histohour'
oldestTs = 1388563200
count = 0
while maxTs >= oldestTs:
    maxTs = df.iloc[0]['time']
    
   
    maxTs -= 1
    # API call with the oldest ts
    url = f"https://min-api.cryptocompare.com/data/v2/{histo}?fsym=BTC&tsym=USD&limit={limit}&toTs={maxTs}&api_key={api_key}"
    r = requests.get(url)
    data = r.json()
    price_df = pd.DataFrame(data['Data']['Data'])
    df = price_df.append(df)
    count += 1

In [5]:
Newdf = df[['time','high','low','open','volumefrom','volumeto','close','conversionType']].copy()
Newdf.head()

,time,high,low,open,volumefrom,volumeto,close,conversionType
0,1377154800,143.88,101.76,120.14,9.452,1099.68,119.69,direct
1,1377158400,144.25,116.49,116.49,5.880,759.34,144.25,direct
2,1377162000,144.25,144.25,144.25,0.000,0.00,144.25,direct
3,1377165600,144.25,123.08,144.25,4.464,549.45,123.08,direct
4,1377169200,145.03,102.16,123.08,6.774,744.64,102.16,direct

In [6]:
Newdf.dropna()

,time,high,low,open,volumefrom,volumeto,close,conversionType
0,1377154800,143.88,101.76,120.14,9.452,1099.68,119.69,direct
1,1377158400,144.25,116.49,116.49,5.880,759.34,144.25,direct
2,1377162000,144.25,144.25,144.25,0.000,0.00,144.25,direct
3,1377165600,144.25,123.08,144.25,4.464,549.45,123.08,direct
4,1377169200,145.03,102.16,123.08,6.774,744.64,102.16,direct
...,...,...,...,...,...,...,...,...
1996,1643670000,38539.65,38381.68,38440.82,604.980,23271421.82,38494.66,direct
1997,1643673600,38649.48,38308.08,38494.66,1002.820,38555857.44,38362.53,direct
1998,1643677200,38421.98,38201.69,38362.53,710.270,27215339.03,38264.38,direct
1999,1643680800,38525.31,38231.66,38264.38,639.720,24557756.74,38508.94,direct
2000,1643684400,38616.80,38423.24,38508.94,377.750,14559034.51,38616.63,direct

In [7]:


Newdf['timestamp_date'] = pd.to_datetime(Newdf['time'],unit = 's')
Newdf.head()

,time,high,low,open,volumefrom,volumeto,close,conversionType,timestamp_date
0,1377154800,143.88,101.76,120.14,9.452,1099.68,119.69,direct,2013-08-22 07:00:00
1,1377158400,144.25,116.49,116.49,5.880,759.34,144.25,direct,2013-08-22 08:00:00
2,1377162000,144.25,144.25,144.25,0.000,0.00,144.25,direct,2013-08-22 09:00:00
3,1377165600,144.25,123.08,144.25,4.464,549.45,123.08,direct,2013-08-22 10:00:00
4,1377169200,145.03,102.16,123.08,6.774,744.64,102.16,direct,2013-08-22 11:00:00

In [8]:
Newdf['timestamp_Year'] = pd.to_datetime(Newdf['timestamp_date'],errors = 'ignore').dt.year
Newdf.head()

,time,high,low,open,volumefrom,volumeto,close,conversionType,timestamp_date,timestamp_Year
0,1377154800,143.88,101.76,120.14,9.452,1099.68,119.69,direct,2013-08-22 07:00:00,2013
1,1377158400,144.25,116.49,116.49,5.880,759.34,144.25,direct,2013-08-22 08:00:00,2013
2,1377162000,144.25,144.25,144.25,0.000,0.00,144.25,direct,2013-08-22 09:00:00,2013
3,1377165600,144.25,123.08,144.25,4.464,549.45,123.08,direct,2013-08-22 10:00:00,2013
4,1377169200,145.03,102.16,123.08,6.774,744.64,102.16,direct,2013-08-22 11:00:00,2013

In [9]:
Crypto_df = Newdf[['high','low','open','close','timestamp_date']]
Crypto_df

          high       low      open     close      timestamp_date
0       143.88    101.76    120.14    119.69 2013-08-22 07:00:00
1       144.25    116.49    116.49    144.25 2013-08-22 08:00:00
2       144.25    144.25    144.25    144.25 2013-08-22 09:00:00
3       144.25    123.08    144.25    123.08 2013-08-22 10:00:00
4       145.03    102.16    123.08    102.16 2013-08-22 11:00:00
...        ...       ...       ...       ...                 ...
1996  38539.65  38381.68  38440.82  38494.66 2022-01-31 23:00:00
1997  38649.48  38308.08  38494.66  38362.53 2022-02-01 00:00:00
1998  38421.98  38201.69  38362.53  38264.38 2022-02-01 01:00:00
1999  38525.31  38231.66  38264.38  38508.94 2022-02-01 02:00:00
2000  38616.80  38423.24  38508.94  38616.63 2022-02-01 03:00:00

[74037 rows x 5 columns]

In [10]:
Crypto_df.tail(24)

          high       low      open     close      timestamp_date
1977  37050.08  36836.51  37049.70  36929.90 2022-01-31 04:00:00
1978  37041.62  36875.74  36929.90  37027.72 2022-01-31 05:00:00
1979  37092.86  36922.45  37027.72  36922.85 2022-01-31 06:00:00
1980  37215.17  36891.93  36922.85  37138.79 2022-01-31 07:00:00
1981  37239.73  37130.33  37138.79  37168.32 2022-01-31 08:00:00
1982  37267.92  37116.23  37168.32  37231.37 2022-01-31 09:00:00
1983  37357.00  37175.50  37231.37  37316.60 2022-01-31 10:00:00
1984  37355.52  36913.55  37316.60  37292.85 2022-01-31 11:00:00
1985  37419.24  36867.46  37292.85  37100.04 2022-01-31 12:00:00
1986  37378.11  36844.68  37100.04  37286.89 2022-01-31 13:00:00
1987  37537.51  37218.04  37286.89  37537.04 2022-01-31 14:00:00
1988  37911.21  37528.54  37537.04  37724.71 2022-01-31 15:00:00
1989  38420.21  37701.31  37724.71  38348.35 2022-01-31 16:00:00
1990  38627.35  38164.53  38348.35  38510.62 2022-01-31 17:00:00
1991  38618.38  38375.18  38510.62  38491.89 2022-01-31 18:00:00
1992  38769.81  38404.65  38491.89  38445.19 2022-01-31 19:00:00
1993  38590.88  38263.78  38445.19  38491.76 2022-01-31 20:00:00
1994  38603.71  38363.77  38491.76  38444.92 2022-01-31 21:00:00
1995  38750.82  38434.61  38444.92  38440.82 2022-01-31 22:00:00
1996  38539.65  38381.68  38440.82  38494.66 2022-01-31 23:00:00
1997  38649.48  38308.08  38494.66  38362.53 2022-02-01 00:00:00
1998  38421.98  38201.69  38362.53  38264.38 2022-02-01 01:00:00
1999  38525.31  38231.66  38264.38  38508.94 2022-02-01 02:00:00
2000  38616.80  38423.24  38508.94  38616.63 2022-02-01 03:00:00

In [11]:
Crypto_df.reset_index(drop=True, inplace=True)
Crypto_df.to_json('Crypto_hourly.json')

In [13]:
Newdf.insert(2,"Coin","BTC")

In [14]:
Newdf.insert(2,"Currency","USD")

In [12]:
Newdf.to_csv("Cryto_hourly.csv",index=False)

In [ ]:
url = f"https://min-api.cryptocompare.com/data/v2/histoday?fsym=BTC&tsym=USD&limit=2000&toTs=-1&api_key={api_key}"
r = requests.get(url)
data = r.json()

In [ ]:
df_daily = pd.DataFrame(data['Data']['Data'])
df_daily.head()

In [ ]:
maxTs = df_daily.iloc[0]['time']
limit = 2000
histo = 'histoday'
oldestTs = 1388563200
count = 0

while maxTs >= oldestTs:

    maxTs = df_daily.iloc[0]['time']
    
    maxTs -= 1
    
    # API call with the oldest ts
    url = f"https://min-api.cryptocompare.com/data/v2/{histo}?fsym=BTC&tsym=USD&limit={limit}&toTs={maxTs}&api_key={api_key}"
    r = requests.get(url)
    data = r.json()
    price_df = pd.DataFrame(data['Data']['Data'])
    df_daily = price_df.append(df_daily)
    count += 1

In [ ]:
df_daily = df_daily[df_daily['time'] >= 1388563200]
df_daily

In [ ]:
Newdf_daily = df_daily[['time','high','low','open','volumefrom','volumeto','close','conversionType']].copy()
Newdf_daily.head()

In [ ]:
Newdf_daily.insert(2,"Coin","BTC")

In [ ]:
Newdf_daily.insert(2,"Currency","USD")

In [ ]:
Newdf_daily.dropna()

In [ ]:
Newdf_daily['timestamp_date'] = pd.to_datetime(Newdf_daily['time'],unit = 's')
Newdf_daily.head()

In [ ]:
Newdf_daily['timestamp_Year'] = pd.to_datetime(Newdf_daily['timestamp_date'],errors = 'ignore').dt.year
Newdf_daily

In [ ]:
Newdf_daily.to_csv("Cryto_daily.csv",index=False)

In [15]:
Newdf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 74037 entries, 0 to 2000
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   time            74037 non-null  int64
 1   high            74037 non-null  float64
 2   Currency        74037 non-null  object
 3   Coin            74037 non-null  object
 4   low             74037 non-null  float64
 5   open            74037 non-null  float64
 6   volumefrom      74037 non-null  float64
 7   volumeto        74037 non-null  float64
 8   close           74037 non-null  float64
 9   conversionType  74037 non-null  object
 10  timestamp_date  74037 non-null  datetime64[ns]
 11  timestamp_Year  74037 non-null  int64
dtypes: datetime64[ns](1), float64(6), int64(2), object(3)
memory usage: 7.3+ MB

In [26]:
from sqlalchemy import Column, Integer, String, Float,BigInteger,Boolean,Date
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import func
Base=declarative_base()

In [27]:
 class CryptoCurr(Base):
    __tablename__ = 'crypto_price'
    id = Column(Integer, primary_key=True)
    time = Column(Integer)
    high = Column(Float)
    Currency = Column(String)
    Coin = Column(String)
    low = Column(Float)
    open = Column(Float)
    volumefrom = Column(Float)
    volumeto = Column(Float)
    close = Column(Float)
    conversionType = Column(String)
    timestamp_date = Column(Date)
    timestamp_Year = Column(Integer)

In [28]:
engine = create_engine(f'postgresql://postgres:{pwd}@localhost:5432/Crypto_db')

In [29]:
Base = automap_base()
Base.prepare(engine, reflect=True)
Base.classes.keys()

[]

In [ ]:
#conn.execute("DROP TABLE crypto_price")

In [30]:
Newdf.to_sql('crypto_price', con=engine,if_exists="append",index=False)
Base.metadata.create_all(engine)

In [31]:
Base.classes.keys()

[]

In [32]:
session = Session(bind=engine)

In [ ]:
CryptoCurr = Base.classes.crypto_price

In [33]:
#This query is get the Highest close price for all the data. 
results = session.query(func.date_part("Year",CryptoCurr.timestamp_date),func.Max(CryptoCurr.close - CryptoCurr.open)).\
          group_by(func.Date_Part("Year",CryptoCurr.timestamp_date)).limit(10).all() 

df = pd.DataFrame(results,columns=['Year','ClosePrice'])
print(df)

     Year  ClosePrice
0  2013.0      472.82
1  2014.0      781.90
2  2015.0       29.00
3  2016.0       40.78
4  2017.0      996.02
5  2018.0      845.49
6  2019.0      898.11
7  2020.0      857.94
8  2021.0     4064.51
9  2022.0     1136.46

In [42]:
#This Result is to get the Total bitcoins traded after 2020 with high price and low price.
results = session.query((CryptoCurr.timestamp_date),func.Max(CryptoCurr.high),func.Min(CryptoCurr.low),CryptoCurr.open,CryptoCurr.close,func.SUM(CryptoCurr.volumefrom)).\
          filter(CryptoCurr.timestamp_date > '2020-01-01').\
          group_by(CryptoCurr.timestamp_date,CryptoCurr.open,CryptoCurr.close,CryptoCurr.volumefrom).\
          order_by(CryptoCurr.volumefrom.desc()).limit(50).all() 


df = pd.DataFrame(results,columns=['Date','high','low','open','close','volumefrom'])
df.head()

                 Date      high       low      open     close  volumefrom
0 2021-01-04 06:00:00  34988.27  32476.39  32835.80  33353.08   235647.61
1 2021-01-25 00:00:00  33016.11  31005.59  32284.95  32622.06   224466.48
2 2021-02-02 16:00:00  35108.35  33333.72  34735.67  35018.96   156939.78
3 2021-01-04 05:00:00  33128.82  30810.40  33287.70  32835.80   155173.86
4 2021-01-09 22:00:00  40957.41  40201.06  40802.21  40438.15   103811.90

In [43]:
df['Date']=pd.to_datetime(df['Date']).astype(str)
df.reset_index(drop=True, inplace=True)
df.to_json(r'Data.json',orient='records')

In [44]:
#Latest Closing Price
results = session.query(CryptoCurr.timestamp_date,CryptoCurr.close).\
          order_by(CryptoCurr.timestamp_date.desc()).limit(1).all() 
print(results)

df = pd.DataFrame(results,columns=['Date','close'])
df.head()

[(datetime.datetime(2022, 2, 1, 3, 0), 38616.63)]

                 Date     close
0 2022-02-01 03:00:00  38616.63

In [45]:
df['Date']=pd.to_datetime(df['Date']).astype(str)
df.reset_index(drop=True, inplace=True)
df.to_json(r'latestClosePrice.json',orient='records')

In [51]:
#All time high
results = session.query(func.Max(CryptoCurr.high)).\
          group_by(CryptoCurr.high).\
          order_by(CryptoCurr.high.desc()).limit(1).all()

df = pd.DataFrame(results,columns=['high'])
df.head()

       high
0  68978.64

In [55]:

df.to_json(r'Alltimehigh.json',orient='records')

In [53]:
#All time low price

results = session.query(func.Min(CryptoCurr.low)).\
          group_by(CryptoCurr.low).\
          order_by(CryptoCurr.low.asc()).limit(1).all()

df = pd.DataFrame(results,columns=['low'])
df.head()

    low
0  5.76

In [56]:

df.to_json(r'Alltimelow.json',orient='records')

In [57]:
#Latest Opening Price
results = session.query(CryptoCurr.timestamp_date,CryptoCurr.open).\
          order_by(CryptoCurr.timestamp_date.desc()).limit(1).all() 
print(results)

df = pd.DataFrame(results,columns=['Date','open'])
df.head()

[(datetime.datetime(2022, 2, 1, 3, 0), 38508.94)]

                 Date      open
0 2022-02-01 03:00:00  38508.94

In [58]:
df['Date']=pd.to_datetime(df['Date']).astype(str)
df.reset_index(drop=True, inplace=True)
df.to_json(r'latestOpenPrice.json',orient='records')

In [61]:
#total volume for current date
results = session.query(CryptoCurr.timestamp_date,func.SUM(CryptoCurr.volumefrom)).\
          group_by(CryptoCurr.timestamp_date).\
          order_by(CryptoCurr.timestamp_date.desc()).limit(1).all()

df = pd.DataFrame(results,columns=['Date','Volume'])
df.head()

                 Date  Volume
0 2022-02-01 03:00:00  377.75

In [62]:
df['Date']=pd.to_datetime(df['Date']).astype(str)
df.reset_index(drop=True, inplace=True)
df.to_json(r'TotalVolume.json',orient='records')

In [ ]:
session.close()